var setTable = function(){
	
	var tableH = [
		{
			'NAME'	: '№ заявки',
			'CLASS'	: 'id',
		},
		{
			'NAME'	: 'Дата',
			'CLASS'	: 'data',
		},
				{
			'NAME'	: 'Заказчик',
			'CLASS'	: 'order',
		},
		{
			'NAME'	: 'Цех',
			'CLASS'	: 'workshop',
		},
		{
			'NAME'	: '№ Детали',
			'CLASS'	: 'item',
		},
		{
			'NAME'	: '№ Чертежа',
			'CLASS'	: 'drawing',
		},
		{
			'NAME'	: 'Описани',
			'CLASS'	: 'description',
		},
		{
			'NAME'	: 'Статус',
			'CLASS'	: 'status',
		},
	]
	
	var tableB = [
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'Y' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'Y' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'R' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'R' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'Y' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'Y' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'R' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', '' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', 'O' ],
		[ '123456', '20.09.22', 'Афиногенов И. О.', '271', '2101-3506045', '2101-3506045', 'Замер диаметра', '' ],
		
	]
	
	
	var block = $( '#table' )
	var str = ''
	str += '<table>'
		str += '<tr>'
		for( var key in tableH ){
			var val = tableH[key]
			str += '<th>'
			str += val.NAME
			str += '</th>'
		}			
		str += '</tr>'
		
		
		
		for( var k in tableB ){
			var v = tableB[k]
			
			var trclass = ''
			if( v[7] == 'Y' ){
				trclass = 'completed'
			}else if( v[7] == 'R' ){
				trclass = 'atwork'
			}else if( v[7] == 'O' ){
				trclass = 'refused'
			}
			
			
			str += '<tr class="' + trclass + '">'
			
			
			for( var key in tableH ){
				var val = tableH[key]
				if( key == 7 ){
					if( v[key] == 'Y' ){
						v[key] = 'Выполнен'
					}else if( v[key] == 'R' ){
						v[key] = 'В работе'
					}else if( v[key] == 'O' ){
						v[key] = 'Отказано'
					}else{
						v[key] = 'Ожидает'
					}
				}
				str += '<td class="' + val.CLASS + '">'
				str += v[key]
				str += '</t>'
			}
			str += '</tr>'
		}			
		
		
	str += '</table>'
	
	
	block.html( str )
}

$( document ).ready(function() {
	setTable()
})